Revit 2026 API

# InitialColor Properties

---

The InitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TemperatureValue | The light color temperature value in Kelvins. |

#### Reference

InitialColor Class

Autodesk.Revit.DB.Lighting Namespace